app/Controllers/Home.php

SELECT *
FROM `tarea`
WHERE `idCreador` = '12'
AND `estado` = '4'
---
    public function archivado()
    {
        $tarea = new TareaModel();
        $data['cabecera'] = view('home/template/cabecera');
        $data['tareas'] = $tarea->where('idCreador', session('id'))->where('estado', '4')->findAll();

SELECT *
FROM `tarea`
WHERE `tarea`.`id` = '41'
UPDATE `tarea` SET `estado` = 4
WHERE `tarea`.`id` IN ('41')
---
    public function archivar($id = null)
    {
        $tarea = new TareaModel();
        $tarea_result = $tarea->find($id);

        $data['estado']=4;

        if ($tarea_result['idCreador'] == session('id')) {
            if ($tarea->update($id, $data)) {