app/Controllers/Subtarea.php

SELECT `idCreador`
FROM `tarea`
WHERE `id` = '54'
 LIMIT 1
---
    public function nueva_subtarea($id = null)
    {
        $data['id'] = $id;
        $data['cabecera'] = view('home/template/cabecera');

        $tarea = new TareaModel();
        $tarea->select('idCreador');
        $tarea = $tarea->where('id', $id)->first();

INSERT INTO `subtarea` (`idTarea`, `descripcion`, `idResponsable`, `fechaCreacion`, `fechaVencimiento`, `comentario`, `estado`, `prioridad`) VALUES ('54', 'Introduccion al proceso industrial', '12', '2023-05-28', '', '', '1', '2')
---
            $subtarea->insert($data);
            return redirect()->to(base_url('/home/tareas'));
        } else {
            if ($subtarea->insert($data) && $colaborador->insert($data_c)) {

UPDATE `tarea` SET `estado` = '2'
WHERE `tarea`.`id` IN ('54')
---
        $tarea = $tarea_sql[0];

        if ($data['estado'] == 3 && $tarea['estado'] == 1) {
            $tareaModel->update($tarea['id'], $data_estado_proceso);

UPDATE `subtarea` SET `estado` = '3', `comentario` = ''
WHERE `subtarea`.`id` IN ('63')
---

        $subtarea = new SubTareaModel();
        if ($subtarea->update($id, $data)) {
            $this->updateSubtarea($tarea['id'], $data_estado_finalizada);

SELECT COUNT(estado)
FROM `subtarea`
WHERE `idTarea` = '54'
 LIMIT 1
SELECT COUNT(estado)
FROM `subtarea`
WHERE `idTarea` = '54'
AND `estado` = 3
 LIMIT 1
UPDATE `tarea` SET `estado` = '3'
WHERE `tarea`.`id` IN ('54')
---
    public function updateSubtarea($id_tarea, $data_estado_finalizada)
    {
        $subtarea = new SubTareaModel();
        $tarea = new TareaModel();

        $total_subtarea = $subtarea->select('COUNT(estado)')->where('idTarea', $id_tarea)->first();
        $total_subtarea_finalizada = $subtarea->select('COUNT(estado)')
            ->where('idTarea', $id_tarea)
            ->where('estado', 3)
            ->first();
        if ($total_subtarea['COUNT(estado)'] - $total_subtarea_finalizada['COUNT(estado)'] == 0) {
            $tarea->update($id_tarea, $data_estado_finalizada);