app/Models/SubTareaModel.php

    public function get_subtareas($where)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('subtarea s');
        $builder->select('s.*,u.nombre,u.apellido,u.email,t.idCreador,e.descripcion as d_estado, p.descripcion as d_prioridad');
        $builder->join('tarea t', 't.id=s.idTarea','left');
        $builder->join('colaboradores c', 's.idTarea=c.idTarea and c.idUsuario='.session('id'),'left');
        $builder->join('usuario u', "u.id=s.idResponsable",'left');
        $builder->join('estado e', "e.id=s.estado",'left');
        $builder->join('prioridad p', "p.id=s.prioridad",'left');
        $builder->where($where);
        $data = $builder->get()->getResultArray();
---
SELECT `s`.*, `u`.`nombre`, `u`.`apellido`, `u`.`email`, `t`.`idCreador`, `e`.`descripcion` as `d_estado`, `p`.`descripcion` as `d_prioridad`
FROM `subtarea` `s`
LEFT JOIN `tarea` `t` ON `t`.`id`=`s`.`idTarea`
LEFT JOIN `colaboradores` `c` ON `s`.`idTarea`=`c`.`idTarea` and `c`.`idUsuario`=12
LEFT JOIN `usuario` `u` ON `u`.`id`=`s`.`idResponsable`
LEFT JOIN `estado` `e` ON `e`.`id`=`s`.`estado`
LEFT JOIN `prioridad` `p` ON `p`.`id`=`s`.`prioridad`
WHERE `t`.`idCreador` = 12 or `c`.`idUsuario` = 12